// task_13_1.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"
#include <iostream>
#include <string>
using namespace std;

int main() { setlocale(LC_CTYPE, "Russian_Russia.1251");
	
    string surnames[25] = {"Иванов", "Петров", "Сидоров", "Козлов", "Васильев", "Смирнов", "Михайлов", "Новиков", "Федоров",
                           "Соколов", "Волков", "Зайцев", "Павлов", "Семенов", "Голубев", "Виноградов", "Богданов", "Воробьев",
                           "Фролов", "Ковалев", "Морозов", "Потапов", "Белов", "Лебедев", "Никитин"};
    string names[25] = {"Иван", "Петр", "Алексей", "Дмитрий", "Андрей", "Александр", "Михаил", "Николай", "Сергей",
                        "Артем", "Владимир", "Илья", "Павел", "Степан", "Виктор", "Денис", "Анатолий", "Федор",
                        "Роман", "Кирилл", "Ярослав", "Глеб", "Максим", "Тимофей", "Егор"};

    for (int i = 0; i < 25; i++) {
        cout << surnames[i] << " " << names[i] << endl;
    }
	system("pause");
    return 0;
}

